In [9]:
%load_ext sql
%sql postgresql:///wdi.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
Traceback (most recent call last):
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/base.py", line 145, in __init__
    self._dbapi_connection = engine.raw_connection()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/base.py", line 3293, in raw_connection
    return self.pool.connect()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 452, in connect
    return _ConnectionFairy._checkout(self)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 1269, in _checkout
    fairy = _ConnectionRecord.checkout(pool)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 716, in checkout
    rec = pool._do_get()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/impl.py", line 170, in _do_get
    self._dec_overflow()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/util/langhelpers.py", line 146, in __exit__
    raise exc_value.with_traceback(exc_tb)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/impl.py", line 167, in _do_get
    return self._create_connection()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 393, in _create_connection
    return _ConnectionRecord(self)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 678, in __init__
    self.__connect()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 903, in __connect
    pool.logger.debug("Error on connect(): %s", e)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/util/langhelpers.py", line 146, in __exit__
    raise exc_value.with_traceback(exc_tb)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 898, in __connect
    self.dbapi_connection = connection = pool._invoke_creator(self)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/create.py", line 645, in connect
    return dialect.connect(*cargs, **cparams)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/default.py", line 616, in connect
    return self.loaded_dbapi.connect(*cargs, **cparams)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/psycopg2/__init__.py", line 122, in connect
    conn = _connect(dsn, connection_factory=connection_factory, **kwasync)
psycopg2.OperationalError: connection to server on socket "/tmp/.s.PGSQL.5432" failed: FATAL:  database "wdi.db" does not exist


The above exception was the direct cause of the following exception:

Traceback (most recent call last):
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sql/magic.py", line 196, in execute
    conn = sql.connection.Connection.set(
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sql/connection.py", line 70, in set
    cls.current = existing or Connection(descriptor, connect_args, creator)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sql/connection.py", line 55, in __init__
    self.internal_connection = engine.connect()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/base.py", line 3269, in connect
    return self._connection_cls(self)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/base.py", line 147, in __init__
    Connection._handle_dbapi_exception_noconnection(
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/base.py", line 2431, in _handle_dbapi_exception_noconnection
    raise sqlalchemy_exception.with_traceback(exc_info[2]) from e
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/base.py", line 145, in __init__
    self._dbapi_connection = engine.raw_connection()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/base.py", line 3293, in raw_connection
    return self.pool.connect()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 452, in connect
    return _ConnectionFairy._checkout(self)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 1269, in _checkout
    fairy = _ConnectionRecord.checkout(pool)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 716, in checkout
    rec = pool._do_get()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/impl.py", line 170, in _do_get
    self._dec_overflow()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/util/langhelpers.py", line 146, in __exit__
    raise exc_value.with_traceback(exc_tb)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/impl.py", line 167, in _do_get
    return self._create_connection()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 393, in _create_connection
    return _ConnectionRecord(self)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 678, in __init__
    self.__connect()
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 903, in __connect
    pool.logger.debug("Error on connect(): %s", e)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/util/langhelpers.py", line 146, in __exit__
    raise exc_value.with_traceback(exc_tb)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/pool/base.py", line 898, in __connect
    self.dbapi_connection = connection = pool._invoke_creator(self)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/create.py", line 645, in connect
    return dialect.connect(*cargs, **cparams)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/sqlalchemy/engine/default.py", line 616, in connect
    return self.loaded_dbapi.connect(*cargs, **cparams)
  File "/Users/mitch/envs/main/lib/python3.9/site-packages/psycopg2/__init__.py", line 122, in connect
    conn = _connect(dsn, connection_factory=connection_factory, **kwasync)
sqlalchemy.exc.OperationalError: (psycopg2.OperationalError) connection to server on socket "/tmp/.s.PGSQL.5432" failed: FATAL:  database "wdi.db" does not exist

(Background on this error at: https://sqlalche.me/e/20/e3q8)

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['postgresql:///wdi'])

In [10]:
%%sql
postgresql:///wdi

## EDA

In [25]:
%%sql
SELECT * FROM main
LIMIT 5

 * postgresql:///wdi
5 rows affected.

[('ABW', 'Aruba', 'Birth_Rate', 1960, 35.679, None, 'Latin America & Caribbean', 'High income'),
 ('ABW', 'Aruba', 'Birth_Rate', 1961, 34.529, -3.22, 'Latin America & Caribbean', 'High income'),
 ('ABW', 'Aruba', 'Birth_Rate', 1962, 33.32, -3.5, 'Latin America & Caribbean', 'High income'),
 ('ABW', 'Aruba', 'Birth_Rate', 1963, 32.05, -3.81, 'Latin America & Caribbean', 'High income'),
 ('ABW', 'Aruba', 'Birth_Rate', 1964, 30.737, -4.1, 'Latin America & Caribbean', 'High income')]

In [26]:
%%sql
SELECT * FROM pop
LIMIT 5

 * postgresql:///wdi
5 rows affected.

[('ABW', 1960, 54208, None),
 ('ABW', 1961, 55434, 2.26),
 ('ABW', 1962, 56234, 1.44),
 ('ABW', 1963, 56699, 0.83),
 ('ABW', 1964, 57029, 0.58)]

In [12]:
%%sql
SELECT DISTINCT(indicator)
FROM main
ORDER BY indicator

 * postgresql:///wdi
7 rows affected.

[('Birth_Rate',),
 ('Consumption',),
 ('Exports',),
 ('GDP',),
 ('Imports',),
 ('Investment',),
 ('Population',)]

In [13]:
%%sql
SELECT DISTINCT(income_group)
FROM main
ORDER BY income_group

 * postgresql:///wdi
4 rows affected.

[('High income',),
 ('Low income',),
 ('Lower middle income',),
 ('Upper middle income',)]

In [15]:
%%sql
SELECT DISTINCT(region)
FROM main
ORDER BY region

 * postgresql:///wdi
7 rows affected.

[('East Asia & Pacific',),
 ('Europe & Central Asia',),
 ('Latin America & Caribbean',),
 ('Middle East & North Africa',),
 ('North America',),
 ('South Asia',),
 ('Sub-Saharan Africa',)]

In [17]:
%%sql
SELECT * FROM pop
LIMIT 10

 * postgresql:///wdi
10 rows affected.

[(0, 'ABW', 1960, 54208, None),
 (1, 'ABW', 1961, 55434, 2.26),
 (2, 'ABW', 1962, 56234, 1.44),
 (3, 'ABW', 1963, 56699, 0.83),
 (4, 'ABW', 1964, 57029, 0.58),
 (5, 'ABW', 1965, 57357, 0.58),
 (6, 'ABW', 1966, 57702, 0.6),
 (7, 'ABW', 1967, 58044, 0.59),
 (8, 'ABW', 1968, 58377, 0.57),
 (9, 'ABW', 1969, 58734, 0.61)]

## Groups: Region

In [119]:
%%sql
SELECT DISTINCT(region)
FROM main
ORDER BY region

 * postgresql:///wdi
7 rows affected.

[('East Asia & Pacific',),
 ('Europe & Central Asia',),
 ('Latin America & Caribbean',),
 ('Middle East & North Africa',),
 ('North America',),
 ('South Asia',),
 ('Sub-Saharan Africa',)]

In [120]:
%%sql
SELECT region, AVG(value) MEAN_GDP
FROM main
WHERE indicator = 'GDP'
AND year = 2020
GROUP BY region
ORDER BY AVG(value)

 * postgresql:///wdi
7 rows affected.

[('Sub-Saharan Africa', 38779423826.42468),
 ('Latin America & Caribbean', 137858206484.2069),
 ('Middle East & North Africa', 168104657507.16254),
 ('South Asia', 404457509131.43933),
 ('Europe & Central Asia', 420846057136.832),
 ('East Asia & Pacific', 776186598896.1621),
 ('North America', 6969434023655.626)]

## Population

### Most populated countries

In [121]:
%%sql
SELECT name, value population
FROM main
WHERE indicator = 'Population'
AND year = 2020
ORDER BY population DESC
LIMIT 10

 * postgresql:///wdi
10 rows affected.

[('China', 1410929362.0),
 ('India', 1380004385.0),
 ('United States', 329484123.0),
 ('Indonesia', 273523621.0),
 ('Pakistan', 220892331.0),
 ('Brazil', 212559409.0),
 ('Nigeria', 206139587.0),
 ('Bangladesh', 164689383.0),
 ('Russia', 144104080.0),
 ('Mexico', 128932753.0)]

### Least Populated Countries

In [122]:
%%sql
SELECT name, value population
FROM main
WHERE indicator = 'Population'
AND year = 2020
ORDER BY population ASC
LIMIT 10

 * postgresql:///wdi
10 rows affected.

[('Nauru', 10834.0),
 ('Tuvalu', 11792.0),
 ('Palau', 18092.0),
 ('British Virgin Islands', 30237.0),
 ('Gibraltar', 33691.0),
 ('San Marino', 33938.0),
 ('Liechtenstein', 38137.0),
 ('St. Martin (French part)', 38659.0),
 ('Turks and Caicos Islands', 38718.0),
 ('Monaco', 39244.0)]

### Fastest Growing

In [123]:
%%sql
SELECT name, region, growth_rate population_growth
FROM main
WHERE indicator = 'Population'
AND year = 2020
ORDER BY growth_rate DESC
LIMIT 10

 * postgresql:///wdi
10 rows affected.

[('Malta', 'Middle East & North Africa', 4.21),
 ('Niger', 'Sub-Saharan Africa', 3.84),
 ('Bahrain', 'Middle East & North Africa', 3.68),
 ('Equatorial Guinea', 'Sub-Saharan Africa', 3.47),
 ('Uganda', 'Sub-Saharan Africa', 3.32),
 ('Angola', 'Sub-Saharan Africa', 3.27),
 ('Dem. Rep. Congo', 'Sub-Saharan Africa', 3.19),
 ('Burundi', 'Sub-Saharan Africa', 3.12),
 ('Mali', 'Sub-Saharan Africa', 3.02),
 ('Chad', 'Sub-Saharan Africa', 3.0)]

### Slowest Growing

In [124]:
%%sql
SELECT name, region, growth_rate population_growth
FROM main
WHERE indicator = 'Population'
AND year = 2020
ORDER BY growth_rate ASC
LIMIT 10

 * postgresql:///wdi
10 rows affected.

[('Moldova', 'Europe & Central Asia', -1.67),
 ('Curaçao', 'Latin America & Caribbean', -1.54),
 ('Kosovo', 'Europe & Central Asia', -0.75),
 ('Latvia', 'Europe & Central Asia', -0.64),
 ('Bosnia and Herzegovina', 'Europe & Central Asia', -0.61),
 ('Bulgaria', 'Europe & Central Asia', -0.6),
 ('Albania', 'Europe & Central Asia', -0.58),
 ('Ukraine', 'Europe & Central Asia', -0.57),
 ('Serbia', 'Europe & Central Asia', -0.53),
 ('Romania', 'Europe & Central Asia', -0.44)]

## Birth Rate

### Highest Birth Rate

In [125]:
%%sql
SELECT name, region, value "Birth Rate"
FROM main
WHERE year = 2019
AND indicator = 'Birth_Rate'
ORDER BY value DESC
LIMIT 10

 * postgresql:///wdi
10 rows affected.

[('Niger', 'Sub-Saharan Africa', 45.637),
 ('Chad', 'Sub-Saharan Africa', 41.665),
 ('Somalia', 'Sub-Saharan Africa', 41.585),
 ('Mali', 'Sub-Saharan Africa', 41.035),
 ('Dem. Rep. Congo', 'Sub-Saharan Africa', 40.639),
 ('Angola', 'Sub-Saharan Africa', 40.232),
 ('Burundi', 'Sub-Saharan Africa', 38.377),
 ('The Gambia', 'Sub-Saharan Africa', 38.073),
 ('Burkina Faso', 'Sub-Saharan Africa', 37.453),
 ('Nigeria', 'Sub-Saharan Africa', 37.446)]

### Lowest Birth Rate

In [126]:
%%sql
SELECT name, region, value "Birth Rate"
FROM main
WHERE year = 2019
AND indicator = 'Birth_Rate'
ORDER BY value ASC
LIMIT 10

 * postgresql:///wdi
10 rows affected.

[('Korea', 'East Asia & Pacific', 5.9),
 ('Puerto Rico', 'Latin America & Caribbean', 6.4),
 ('San Marino', 'Europe & Central Asia', 6.7),
 ('Japan', 'East Asia & Pacific', 7.0),
 ('Andorra', 'Europe & Central Asia', 7.0),
 ('Italy', 'Europe & Central Asia', 7.0),
 ('Hong Kong SAR, China', 'East Asia & Pacific', 7.0),
 ('Spain', 'Europe & Central Asia', 7.6),
 ('Greece', 'Europe & Central Asia', 7.8),
 ('Bosnia and Herzegovina', 'Europe & Central Asia', 7.938)]

## Groups: Income

### Income Share

In [127]:
%%sql
SELECT income_group, SUM(value) / (SELECT SUM(value) FROM main WHERE indicator = 'GDP' AND year = 2020) income_share
FROM main
WHERE indicator = 'GDP'
AND year = 2020
GROUP BY income_group
ORDER BY income_group

 * postgresql:///wdi
4 rows affected.

[('High income', 0.6121480266165841),
 ('Low income', 0.005185930553895965),
 ('Lower middle income', 0.09340919583662892),
 ('Upper middle income', 0.2892568469928908)]

### Mean Income

In [128]:
%%sql
SELECT income_group, AVG(value)
FROM main
WHERE indicator = 'GDP'
AND year = 2020
GROUP BY income_group
ORDER BY AVG(value) DESC

 * postgresql:///wdi
4 rows affected.

[('High income', 760392951921.6853),
 ('Upper middle income', 440659121096.2202),
 ('Lower middle income', 139666052665.53592),
 ('Low income', 18205132589.924522)]

## Group: Region

### Population Share

In [129]:
%%sql
SELECT region "Region",
 ROUND(100*(SUM(value) / (SELECT SUM(value) FROM main WHERE indicator = 'Population' AND year = 2020))::numeric, 2) "Population Share"
FROM main
WHERE indicator = 'Population'
AND year = 2020
GROUP BY region
ORDER BY SUM(value) DESC

 * postgresql:///wdi
7 rows affected.

[('East Asia & Pacific', Decimal('30.33')),
 ('South Asia', Decimal('24.10')),
 ('Sub-Saharan Africa', Decimal('14.70')),
 ('Europe & Central Asia', Decimal('11.98')),
 ('Latin America & Caribbean', Decimal('8.10')),
 ('Middle East & North Africa', Decimal('6.03')),
 ('North America', Decimal('4.77'))]

### Income Share

In [132]:
%%sql
SELECT region "Region",
 ROUND(100*(SUM(value) / (SELECT SUM(value) FROM main WHERE indicator = 'GDP' AND year = 2020))::numeric, 2) "Income Share"
FROM main
WHERE indicator = 'GDP'
AND year = 2020
GROUP BY region
ORDER BY SUM(value) DESC

 * postgresql:///wdi
7 rows affected.

[('East Asia & Pacific', Decimal('31.72')),
 ('Europe & Central Asia', Decimal('26.06')),
 ('North America', Decimal('25.90')),
 ('Latin America & Caribbean', Decimal('6.15')),
 ('South Asia', Decimal('4.01')),
 ('Middle East & North Africa', Decimal('3.96')),
 ('Sub-Saharan Africa', Decimal('2.21'))]

## Covid 19 Crisis

In [27]:
%%sql
SELECT * FROM 
main LEFT JOIN pop
ON main.country_code = pop.country_code
AND main.year = pop.year
LIMIT 10

 * postgresql:///wdi
10 rows affected.

[('ABW', 'Aruba', 'Birth_Rate', 1960, 35.679, None, 'Latin America & Caribbean', 'High income', 'ABW', 1960, 54208, None),
 ('ABW', 'Aruba', 'Birth_Rate', 1961, 34.529, -3.22, 'Latin America & Caribbean', 'High income', 'ABW', 1961, 55434, 2.26),
 ('ABW', 'Aruba', 'Birth_Rate', 1962, 33.32, -3.5, 'Latin America & Caribbean', 'High income', 'ABW', 1962, 56234, 1.44),
 ('ABW', 'Aruba', 'Birth_Rate', 1963, 32.05, -3.81, 'Latin America & Caribbean', 'High income', 'ABW', 1963, 56699, 0.83),
 ('ABW', 'Aruba', 'Birth_Rate', 1964, 30.737, -4.1, 'Latin America & Caribbean', 'High income', 'ABW', 1964, 57029, 0.58),
 ('ABW', 'Aruba', 'Birth_Rate', 1965, 29.413, -4.31, 'Latin America & Caribbean', 'High income', 'ABW', 1965, 57357, 0.58),
 ('ABW', 'Aruba', 'Birth_Rate', 1966, 28.121, -4.39, 'Latin America & Caribbean', 'High income', 'ABW', 1966, 57702, 0.6),
 ('ABW', 'Aruba', 'Birth_Rate', 1967, 26.908, -4.31, 'Latin America & Caribbean', 'High income', 'ABW', 1967, 58044, 0.59),
 ('ABW', 'Aruba', 'Birth_Rate', 1968, 25.817, -4.05, 'Latin America & Caribbean', 'High income', 'ABW', 1968, 58377, 0.57),
 ('ABW', 'Aruba', 'Birth_Rate', 1969, 24.872, -3.66, 'Latin America & Caribbean', 'High income', 'ABW', 1969, 58734, 0.61)]